{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "#THIS NOTEBOOK WILL READ DATA FROM CSV FILE, AND CREATE NODES AND BASIC RELATIONSHIPS IN GIVEN NEO4J DB.\n",
    "\n",
    "#WILL CREATE:\n",
    "#Nodes with Labels : Article, Author, Tag\n",
    "#Relations : (:Article)-[:HAS_TAG]-(:Tag) , (ARTICLE)-[:WRITTEN_BY]-(:AUTHOR)\n",
    "\n",
    "from neo4j import GraphDatabase, basic_auth\n",
    "from neo4j.exceptions import Neo4jError\n",
    "import neo4j.time\n",
    "import csv\n",
    "import json\n",
    "import time\n",
    "import os\n",
    "from flask_restful_swagger_2 import Api, swagger, Schema\n",
    "\n",
    "\n",
    "#USER CONFIG \n",
    "DATABASE_USERNAME=\"neo4j\"\n",
    "DATABASE_PASSWORD=\"spade-discounts-switch\"\n",
    "DATABASE_URL=\"bolt://localhost:7687\"\n",
    "DATA_FILE_PATH = 'dev-to-articles.csv'\n",
    "#USER CONFIG END\n",
    "def cprint(content,module='DEBUG',*args):\n",
    "    if args:\n",
    "        print('\\033[1;32;43m ['+module+'] \\033[0m '+ content + '\\033[1;35m' +str(args) +' \\033[0m' + time.strftime(\" |%Y-%m-%d %H:%M:%S|\", time.localtime()) )\n",
    "    else:\n",
    "        print('\\033[1;32;43m ['+module+'] \\033[0m '+ content + time.strftime(\" |%Y-%m-%d %H:%M:%S|\", time.localtime()))\n",
    "        \n",
    "driver = GraphDatabase.driver(DATABASE_URL, auth=basic_auth(DATABASE_USERNAME, str(DATABASE_PASSWORD)))\n",
    "\n",
    "class ArticleModel(Schema):\n",
    "    type = 'object'\n",
    "    properties = {\n",
    "        'id': {\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'title': {\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'url': {\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'main_image_url': {\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'reading_time': {\n",
    "            'type': 'integer',\n",
    "        },\n",
    "        'tag_names': {\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'published_at': {\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'public_reactions_count':{\n",
    "            'type': 'integer',\n",
    "        },\n",
    "        'source_site':{\n",
    "            'type': 'string',\n",
    "        }\n",
    "    }\n",
    "\n",
    "class AuthorModel(Schema):\n",
    "    type = 'object'\n",
    "    properties = {\n",
    "        'id':{\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'username':{\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'name':{\n",
    "            'type': 'string',\n",
    "        }\n",
    "    }\n",
    "\n",
    "class TagModel(Schema):\n",
    "    type = 'object'\n",
    "    properties = {\n",
    "        'name':{\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'keywords_for_search':{\n",
    "            'type': 'string',\n",
    "        }\n",
    "    }\n",
    "def serialize_article(article):\n",
    "    return {\n",
    "        'id': article['id'],\n",
    "        'title': article['title'],\n",
    "        'url': article['url'],\n",
    "        'main_image_url': article['main_image_url'],\n",
    "        'reading_time': article['reading_time'],\n",
    "        'tag_names': article['tag_names'],\n",
    "        'published_at': article['published_at'],\n",
    "        'source_site': article['source_site'],\n",
    "    }\n",
    "def serialize_author(author):\n",
    "    return {\n",
    "        'id': author['id'],\n",
    "        'username': author['username'],\n",
    "        'name': author['name'],\n",
    "    }\n",
    "def serialize_tag(tag):\n",
    "    return{\n",
    "        'name':tag['name'],\n",
    "        'keywords_for_search':tag['keywords_for_search']\n",
    "    }\n",
    "   \n",
    "def db_create_nodes(session,labels,properties):\n",
    "    '''\n",
    "    Create nodes with custom labels and properties\n",
    "    Args:\n",
    "        session: db session,driver.session()\n",
    "        labels: [\"Human\", \"MovieStar\"]\n",
    "        properties => [{name: \"Tom Cruise\", placeOfBirth: \"Syracuse, New York, United States\"},\n",
    "                        {name: \"Reese Witherspoon\", placeOfBirth: \"New Orleans, Louisiana, United States\"}]\n",
    "    Return:\n",
    "        Added nodes \n",
    "    '''\n",
    "    def _cypher(tx, labels, properties):\n",
    "                return list(tx.run(\n",
    "                    '''\n",
    "                    CALL apoc.create.nodes( $labels, $properties);\n",
    "                    ''', {'labels': labels , 'properties': properties}\n",
    "                ))\n",
    "    result = session.write_transaction(_cypher,labels,properties)\n",
    "    cprint(str(len(result))+'record added','DB')\n",
    "    return result\n",
    "\n",
    "def db_get_nodes(session,label,limit):\n",
    "    '''\n",
    "    Return Nodes with a given label\n",
    "    Args:\n",
    "        session: db session,driver.session()\n",
    "        labels: [\"Human\"]\n",
    "        limit: max number of nodes\n",
    "    Return:\n",
    "        Cypher result\n",
    "    '''\n",
    "    def _cypher(tx,label,limit):\n",
    "        return list(tx.run(\n",
    "            '''\n",
    "            MATCH (n:$label) RETURN n LIMIT $limit\n",
    "            ''', {'label': label , 'limit': limit}\n",
    "        ))\n",
    "    result = session.read_transaction(_cypher,label,limit)\n",
    "    cprint('Get '+str(len(result))+' records','DB')\n",
    "    return result\n",
    "\n",
    "def db_create_relation(session,label,props,id1,id2):\n",
    "    '''\n",
    "    Create relation with specific id\n",
    "    Args:\n",
    "        session: db session,driver.session()\n",
    "        labels: [\"Human\"]\n",
    "        limit: max number of nodes\n",
    "    Return:\n",
    "        Cypher result\n",
    "    '''\n",
    "    def _cypher(tx,label,id1,id2,props):\n",
    "        return list(tx.run(\n",
    "        '''\n",
    "        MATCH (p) WHERE id(p) = $id1\n",
    "        MATCH (m) WHERE id(m) = $id2\n",
    "        CALL apoc.create.relationship(p, $label, $props, m)\n",
    "        YIELD rel\n",
    "        RETURN rel;\n",
    "        ''',{'label':label,'props':props,'id1':id1,'id2':id2}\n",
    "        ))\n",
    "    result = session.write_transaction(_cypher,label,props,id1,id2)\n",
    "    cprint(str(len(result))+'record added','DB')\n",
    "    return result\n",
    "\n",
    "def db_update_article_author(session,id,value):\n",
    "    '''\n",
    "    Add a new value for article node with id\n",
    "    Args:\n",
    "        session: db session,driver.session()\n",
    "        id: article id, in csv file.\n",
    "        value: value of that key : author\n",
    "    '''\n",
    "    def _cypher(tx,id,value):\n",
    "        return list(tx.run(\n",
    "        '''\n",
    "        MATCH (n:Article { id: $id })\n",
    "        SET n.author = $value\n",
    "        RETURN n\n",
    "        ''',{'id':id,'value':value}\n",
    "        ))\n",
    "    result = session.write_transaction(_cypher,id,value)\n",
    "    return result\n",
    "def db_update_article_count(session,id,value):\n",
    "    '''\n",
    "    Add a new value for article node with id\n",
    "    Args:\n",
    "        session: db session,driver.session()\n",
    "        id: article id, in csv file.\n",
    "        value: value of that key : count\n",
    "    '''\n",
    "    def _cypher(tx,id,value):\n",
    "        return list(tx.run(\n",
    "        '''\n",
    "        MATCH (n:Article { id: $id })\n",
    "        SET n.count = $value\n",
    "        RETURN n\n",
    "        ''',{'id':id,'value':value}\n",
    "        ))\n",
    "    result = session.write_transaction(_cypher,id,value)\n",
    "    return result\n",
    "\n",
    "\n",
    "\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[1;32;43m [CSV] \u001b[0m Processing CSV header id, title, url, main_image_url, reading_time, author_name, author_username, author_id, published_at, tag_names, keywords_for_search, comments_count, public_reactions_count, highlight |2021-05-09 18:11:47|\n",
      "\u001b[1;32;43m [CSV] \u001b[0m File processed successfully with 1334 ids. |2021-05-09 18:11:48|\n"
     ]
    }
   ],
   "source": [
    "# This block return 3 list of nodes for a given csv file to generate nodes.\n",
    "# Article :\n",
    "article_props = []\n",
    "# Author:\n",
    "author_props = []\n",
    "# Tag:\n",
    "tag_props = []\n",
    "if os.path.exists(DATA_FILE_PATH):\n",
    "    if not os.path.getsize(DATA_FILE_PATH):\n",
    "        cprint(DATA_FILE_PATH +'is empty')\n",
    "    else:\n",
    "        with open(DATA_FILE_PATH, mode='r',encoding=\"utf-8\") as data_file_r:\n",
    "            csv_reader = csv.DictReader(data_file_r)\n",
    "            line_count = 0\n",
    "            props=set()\n",
    "            for row in csv_reader:\n",
    "                if line_count == 0:\n",
    "                    cprint(f'Processing CSV header {\", \".join(row)}','CSV')\n",
    "                    line_count += 1\n",
    "                article_prop = {\n",
    "                            'id': row['id'],\n",
    "                            'title': row['title'],\n",
    "                            'url': row['url'],\n",
    "                            'main_image_url': row['main_image_url'],\n",
    "                            'reading_time': row['reading_time'],\n",
    "                            'tag_names': row['tag_names'],\n",
    "                            'published_at': row['published_at'],\n",
    "                            'source_site':'dev.to',\n",
    "                            'author_name':row['author_name'],\n",
    "                            'count':row['public_reactions_count']\n",
    "                }\n",
    "                if article_prop in article_props:\n",
    "                    continue\n",
    "                else:\n",
    "                    article_props.append(article_prop)\n",
    "                    \n",
    "                author_prop = {\n",
    "                            'id': row['author_id'],\n",
    "                            'username': row['author_username'],\n",
    "                            'name': row['author_name'],\n",
    "                }\n",
    "                if author_prop in author_props:\n",
    "                    continue\n",
    "                else:\n",
    "                    author_props.append(author_prop)\n",
    "                \n",
    "                for tag in row['tag_names'].split('+'):\n",
    "                    tag_prop = {\n",
    "                            'name':tag,\n",
    "                            'keywords_for_search':''\n",
    "                    }\n",
    "                    if tag_prop in tag_props:\n",
    "                        continue\n",
    "                    else:\n",
    "                        tag_props.append(tag_prop)\n",
    "                \n",
    "                #end todo\n",
    "                line_count += 1\n",
    "            cprint(f'File processed successfully with {line_count-1} ids.','CSV')\n",
    "        data_file_r.close()\n",
    "else:\n",
    "    cprint(DATA_FILE_PATH +' does not exist')\n",
    "        \n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'themeselection'"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "article_props[1]['author_name']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[1;32;43m [DB] \u001b[0m 1334record added |2021-04-02 21:33:53|\n"
     ]
    }
   ],
   "source": [
    "#ONLY RUN THIS CELL ONCE TO CREATE NODES\n",
    "with driver.session() as session: \n",
    "#     res = db_create_nodes(session,['Article'],props)\n",
    "#     res = db_create_nodes(session,['Tag'],tag_props)\n",
    "#     res = db_create_nodes(session,['Author'],author_props)\n",
    "    session.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "#UPDATE ADDITIONAL VALUE\n",
    "with driver.session() as session: \n",
    "    for article in article_props:\n",
    "        db_update_article_author(session,article['id'],article['author_name'])\n",
    "        db_update_article_count(session,article['id'],article['count'])\n",
    "    session.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#RUN THIS CELL TO CREATE [:HAS_TAG]\n",
    "def db_create_tag_relation_to_article(session,tag_name,article_url):\n",
    "    '''\n",
    "    Args: db session, Tag.name, Article.url\n",
    "    Return: cypher result of created relation\n",
    "    '''\n",
    "    def _cypher(tx,tag_name,article_url):\n",
    "#CALL apoc.create.relationship(a, \"HAS_TAG\",{article_id:$article_id, tag_name:$tag_name},  t)\n",
    "        return list(tx.run(\n",
    "        '''\n",
    "        MATCH (a:Article {url: $article_url})\n",
    "        MATCH (b:Tag {name: $tag_name})\n",
    "        MERGE (a)-[rel:HAS_TAG]->(b)\n",
    "        RETURN rel\n",
    "        ''',{'article_url':article_url,'tag_name':tag_name}\n",
    "        \n",
    "        ))    \n",
    "    result = session.write_transaction(_cypher,tag_name,article_url)\n",
    "    return result\n",
    "with driver.session() as session:\n",
    "    counter=0\n",
    "    for article in article_props:\n",
    "        for tag in article['tag_names'].split('+'):\n",
    "            res = db_create_tag_relation_to_article(session,tag,article['url'])\n",
    "            if not res:\n",
    "                cprint('Failed to create relation with '+str(article['url']+\" -> \"+str(tag)))\n",
    "                \n",
    "#             cprint(tag+article['id'])\n",
    "            else:\n",
    "                counter+=1\n",
    "    cprint(str(counter)+' record added','DB')\n",
    "    session.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "#RUN THIS CELL TO CREATE [:WRITTEN_BY]\n",
    "def db_create_author_relation_to_article(session):\n",
    "    '''\n",
    "    Request: csv file\n",
    "    Args: db session\n",
    "    Return: None\n",
    "    '''\n",
    "    def _cypher(tx,url,username):\n",
    "        return list(tx.run(\n",
    "        '''\n",
    "        MATCH (a:Article {url: $url})\n",
    "        MATCH (b:Author {username: $username})\n",
    "        MERGE (a)-[rel:WRITTEN_BY]->(b)\n",
    "        RETURN rel\n",
    "        ''',{'url':url,'username':username}\n",
    "        ))\n",
    "    if os.path.exists(DATA_FILE_PATH):\n",
    "        if not os.path.getsize(DATA_FILE_PATH):\n",
    "            cprint(DATA_FILE_PATH +'is empty')\n",
    "        else:\n",
    "            with open(DATA_FILE_PATH, mode='r',encoding=\"utf-8\") as data_file_r:\n",
    "                csv_reader = csv.DictReader(data_file_r)\n",
    "                line_count = 0\n",
    "                props=set()\n",
    "                for row in csv_reader:\n",
    "                    if line_count == 0:\n",
    "                        cprint(f'Processing CSV header {\", \".join(row)}','CSV')\n",
    "                        line_count += 1\n",
    "                    session.write_transaction(_cypher,row['url'],row['author_username'])\n",
    "                    line_count += 1\n",
    "                cprint(f'File processed successfully with {line_count-1} ids.','CSV')\n",
    "                cprint(f'Added {line_count-1} relations.','DB')\n",
    "            data_file_r.close()\n",
    "    else:\n",
    "        cprint(DATA_FILE_PATH +' does not exist')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[1;32;43m [CSV] \u001b[0m Processing CSV header id, title, url, main_image_url, reading_time, author_name, author_username, author_id, published_at, tag_names, keywords_for_search, comments_count, public_reactions_count, highlight |2021-04-26 20:46:33|\n",
      "\u001b[1;32;43m [CSV] \u001b[0m File processed successfully with 2380 ids. |2021-04-26 20:47:07|\n",
      "\u001b[1;32;43m [DB] \u001b[0m Added 2380 relations. |2021-04-26 20:47:07|\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session: \n",
    "    db_create_author_relation_to_article(session)\n",
    "    session.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
