{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "#THIS NOTEBOOK WILL READ DATA FROM CSV FILE, AND CREATE NODES AND BASIC RELATIONSHIPS IN GIVEN NEO4J DB.\n",
    "\n",
    "from neo4j import GraphDatabase, basic_auth\n",
    "from neo4j.exceptions import Neo4jError\n",
    "import neo4j.time\n",
    "import csv\n",
    "import json\n",
    "import time\n",
    "import os\n",
    "from flask_restful_swagger_2 import Api, swagger, Schema\n",
    "\n",
    "\n",
    "#USER CONFIG \n",
    "DATABASE_USERNAME=\"neo4j\"\n",
    "DATABASE_PASSWORD=\"spade-discounts-switch\"\n",
    "DATABASE_URL=\"bolt://localhost:7687\"\n",
    "DATA_FILE_PATH = 'dev-to-articles.csv'\n",
    "#USER CONFIG END\n",
    "def cprint(content,module='DEBUG',*args):\n",
    "    if args:\n",
    "        print('\\033[1;32;43m ['+module+'] \\033[0m '+ content + '\\033[1;35m' +str(args) +' \\033[0m' + time.strftime(\" |%Y-%m-%d %H:%M:%S|\", time.localtime()) )\n",
    "    else:\n",
    "        print('\\033[1;32;43m ['+module+'] \\033[0m '+ content + time.strftime(\" |%Y-%m-%d %H:%M:%S|\", time.localtime()))\n",
    "        \n",
    "driver = GraphDatabase.driver(DATABASE_URL, auth=basic_auth(DATABASE_USERNAME, str(DATABASE_PASSWORD)))\n",
    "\n",
    "class ArticleModel(Schema):\n",
    "    type = 'object'\n",
    "    properties = {\n",
    "        'id': {\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'title': {\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'url': {\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'main_image_url': {\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'reading_time': {\n",
    "            'type': 'integer',\n",
    "        },\n",
    "        'tag_names': {\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'published_at': {\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'public_reactions_count':{\n",
    "            'type': 'integer',\n",
    "        },\n",
    "        'source_site':{\n",
    "            'type': 'string',\n",
    "        }\n",
    "    }\n",
    "\n",
    "class AuthorModel(Schema):\n",
    "    type = 'object'\n",
    "    properties = {\n",
    "        'id':{\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'username':{\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'name':{\n",
    "            'type': 'string',\n",
    "        }\n",
    "    }\n",
    "\n",
    "class TagModel(Schema):\n",
    "    type = 'object'\n",
    "    properties = {\n",
    "        'name':{\n",
    "            'type': 'string',\n",
    "        },\n",
    "        'keywords_for_search':{\n",
    "            'type': 'string',\n",
    "        }\n",
    "    }\n",
    "def serialize_article(article):\n",
    "    return {\n",
    "        'id': article['id'],\n",
    "        'title': article['title'],\n",
    "        'url': article['url'],\n",
    "        'main_image_url': article['main_image_url'],\n",
    "        'reading_time': article['reading_time'],\n",
    "        'tag_names': article['tag_names'],\n",
    "        'published_at': article['published_at'],\n",
    "        'source_site': article['source_site'],\n",
    "    }\n",
    "def serialize_author(author):\n",
    "    return {\n",
    "        'id': author['id'],\n",
    "        'username': author['username'],\n",
    "        'name': author['name'],\n",
    "    }\n",
    "def serialize_tag(tag):\n",
    "    return{\n",
    "        'name':tag['name'],\n",
    "        'keywords_for_search':tag['keywords_for_search']\n",
    "    }\n",
    "   \n",
    "def db_create_nodes(session,labels,properties):\n",
    "    '''\n",
    "    Create nodes with custom labels and properties\n",
    "    Args:\n",
    "        session: db session,driver.session()\n",
    "        labels: [\"Human\", \"MovieStar\"]\n",
    "        properties => [{name: \"Tom Cruise\", placeOfBirth: \"Syracuse, New York, United States\"},\n",
    "                        {name: \"Reese Witherspoon\", placeOfBirth: \"New Orleans, Louisiana, United States\"}]\n",
    "    Return:\n",
    "        Added nodes \n",
    "    '''\n",
    "    def _cypher(tx, labels, properties):\n",
    "                return list(tx.run(\n",
    "                    '''\n",
    "                    CALL apoc.create.nodes( $labels, $properties);\n",
    "                    ''', {'labels': labels , 'properties': properties}\n",
    "                ))\n",
    "    result = session.write_transaction(_cypher,labels,properties)\n",
    "    cprint(str(len(result))+'record added','DB')\n",
    "    return result\n",
    "\n",
    "def db_get_nodes(session,label,limit):\n",
    "    '''\n",
    "    Return Nodes with a given label\n",
    "    Args:\n",
    "        session: db session,driver.session()\n",
    "        labels: [\"Human\"]\n",
    "        limit: max number of nodes\n",
    "    Return:\n",
    "        Cypher result\n",
    "    '''\n",
    "    def _cypher(tx,label,limit):\n",
    "        return list(tx.run(\n",
    "            '''\n",
    "            MATCH (n:$label) RETURN n LIMIT $limit\n",
    "            ''', {'label': label , 'limit': limit}\n",
    "        ))\n",
    "    result = session.read_transaction(_cypher,label,limit)\n",
    "    cprint('Get '+str(len(result))+' records','DB')\n",
    "    return result\n",
    "\n",
    "def db_create_relation(session,label,props,id1,id2):\n",
    "    '''\n",
    "    Create relation with specific id\n",
    "    Args:\n",
    "        session: db session,driver.session()\n",
    "        labels: [\"Human\"]\n",
    "        limit: max number of nodes\n",
    "    Return:\n",
    "        Cypher result\n",
    "    '''\n",
    "    def _cypher(tx,label,id1,id2,props):\n",
    "        return list(tx.run(\n",
    "        '''\n",
    "        MATCH (p) WHERE id(p) = $id1\n",
    "        MATCH (m) WHERE id(m) = $id2\n",
    "        CALL apoc.create.relationship(p, $label, $props, m)\n",
    "        YIELD rel\n",
    "        RETURN rel;\n",
    "        ''',{'label':label,'props':props,'id1':id1,'id2':id2}\n",
    "        ))\n",
    "    result = session.write_transaction(_cypher,label,props,id1,id2)\n",
    "    cprint(str(len(result))+'record added','DB')\n",
    "    return result\n",
    "\n",
    "\n",
    "\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[1;32;43m [CSV] \u001b[0m Processing CSV header id, title, url, main_image_url, reading_time, author_name, author_username, author_id, published_at, tag_names, keywords_for_search, comments_count, public_reactions_count, highlight |2021-04-02 21:14:07|\n",
      "\u001b[1;32;43m [CSV] \u001b[0m File processed successfully with 1334 ids. |2021-04-02 21:14:08|\n"
     ]
    }
   ],
   "source": [
    "# This block return 3 list of nodes for a given csv file:\n",
    "# Article :\n",
    "article_props = []\n",
    "# Author:\n",
    "author_props = []\n",
    "# Tag:\n",
    "tag_props = []\n",
    "if os.path.exists(DATA_FILE_PATH):\n",
    "    if not os.path.getsize(DATA_FILE_PATH):\n",
    "        cprint(DATA_FILE_PATH +'is empty')\n",
    "    else:\n",
    "        with open(DATA_FILE_PATH, mode='r',encoding=\"utf-8\") as data_file_r:\n",
    "            csv_reader = csv.DictReader(data_file_r)\n",
    "            line_count = 0\n",
    "            props=set()\n",
    "            for row in csv_reader:\n",
    "                if line_count == 0:\n",
    "                    cprint(f'Processing CSV header {\", \".join(row)}','CSV')\n",
    "                    line_count += 1\n",
    "                article_prop = {\n",
    "                            'id': row['id'],\n",
    "                            'title': row['title'],\n",
    "                            'url': row['url'],\n",
    "                            'main_image_url': row['main_image_url'],\n",
    "                            'reading_time': row['reading_time'],\n",
    "                            'tag_names': row['tag_names'],\n",
    "                            'published_at': row['published_at'],\n",
    "                            'source_site':'dev.to',\n",
    "                }\n",
    "                if article_prop in article_props:\n",
    "                    continue\n",
    "                else:\n",
    "                    article_props.append(article_prop)\n",
    "                    \n",
    "                author_prop = {\n",
    "                            'id': row['author_id'],\n",
    "                            'username': row['author_username'],\n",
    "                            'name': row['author_name'],\n",
    "                }\n",
    "                if author_prop in author_props:\n",
    "                    continue\n",
    "                else:\n",
    "                    author_props.append(author_prop)\n",
    "                \n",
    "                for tag in row['tag_names'].split('+'):\n",
    "                    tag_prop = {\n",
    "                            'name':tag,\n",
    "                            'keywords_for_search':''\n",
    "                    }\n",
    "                    if tag_prop in tag_props:\n",
    "                        continue\n",
    "                    else:\n",
    "                        tag_props.append(tag_prop)\n",
    "                \n",
    "                #end todo\n",
    "                line_count += 1\n",
    "            cprint(f'File processed successfully with {line_count-1} ids.','CSV')\n",
    "        data_file_r.close()\n",
    "else:\n",
    "    cprint(DATA_FILE_PATH +' does not exist')\n",
    "        \n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[1;32;43m [DB] \u001b[0m 1334record added |2021-04-02 21:33:53|\n"
     ]
    }
   ],
   "source": [
    "with driver.session() as session: \n",
    "#     labels = ['Article']\n",
    "#     res = db_create_nodes(session,labels,props)\n",
    "#     res = db_create_nodes(session,['Tag'],tag_props)\n",
    "    res = db_create_nodes(session,['Author'],author_props)\n",
    "    session.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'name': 'beginners', 'keywords_for_search': ''},\n",
       " {'name': 'devops', 'keywords_for_search': ''}]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tag_props[1:3]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': '494489',\n",
       "  'title': 'Full Docker Course [FREE] ðŸŽ‰ ðŸ³',\n",
       "  'url': 'https://dev.to//techworld_with_nana/full-docker-course-free-4hl3',\n",
       "  'main_image_url': 'https://dev-to-uploads.s3.amazonaws.com/i/a0gvmzph343m9wvjys6h.png',\n",
       "  'reading_time': '2',\n",
       "  'tag_names': 'tutorial+beginners+devops+docker',\n",
       "  'published_at': '2020-10-22T07:40:13.566Z',\n",
       "  'source_site': 'dev.to'},\n",
       " {'id': '478718',\n",
       "  'title': 'ReactJS Roadmap ðŸ—º For Developers.ðŸ’»',\n",
       "  'url': 'https://dev.to//theme_selection/reactjs-roadmap-for-developers-2824',\n",
       "  'main_image_url': 'https://res.cloudinary.com/practicaldev/image/fetch/s--1sbeprFD--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/i/4t5s6u97jg9czgrdb6bk.png',\n",
       "  'reading_time': '7',\n",
       "  'tag_names': 'beginners+javascript+react+webdev',\n",
       "  'published_at': '2020-10-06T13:53:31.598Z',\n",
       "  'source_site': 'dev.to'},\n",
       " {'id': '458580',\n",
       "  'title': '10 useful HTML5 features, you may not be using',\n",
       "  'url': 'https://dev.to//atapas/10-useful-html5-features-you-may-not-be-using-2bk0',\n",
       "  'main_image_url': 'https://res.cloudinary.com/practicaldev/image/fetch/s--M9Gl4H0K--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/i/4l6fsv0bm6vw0omltd2h.png',\n",
       "  'reading_time': '8',\n",
       "  'tag_names': 'webdev+codenewbie+javascript+html',\n",
       "  'published_at': '2020-09-17T12:46:05.739Z',\n",
       "  'source_site': 'dev.to'}]"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "article_props[0:3]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#DBF\n",
    "def db_create_tag_relation_to_article(session,tag_name,article_url):\n",
    "    def _cypher(tx,tag_name,article_url):\n",
    "#CALL apoc.create.relationship(a, \"HAS_TAG\",{article_id:$article_id, tag_name:$tag_name},  t)\n",
    "        return list(tx.run(\n",
    "        '''\n",
    "        MATCH (a:Article {url: $article_url})\n",
    "        MATCH (b:Tag {name: $tag_name})\n",
    "        CREATE (a)-[rel:HAS_TAG]->(b)\n",
    "        RETURN rel\n",
    "        ''',{'article_url':article_url,'tag_name':tag_name}\n",
    "        \n",
    "        ))    \n",
    "    result = session.write_transaction(_cypher,tag_name,article_url)\n",
    "    return result\n",
    "with driver.session() as session:\n",
    "    counter=0\n",
    "    for article in article_props:\n",
    "        for tag in article['tag_names'].split('+'):\n",
    "            res = db_create_tag_relation_to_article(session,tag,article['url'])\n",
    "            if not res:\n",
    "                cprint('Failed to create relation with '+str(article['url']+\" -> \"+str(tag)))\n",
    "                \n",
    "#             cprint(tag+article['id'])\n",
    "            else:\n",
    "                counter+=1\n",
    "    cprint(str(counter)+' record added','DB')\n",
    "    session.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'time' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-7-02ea503aed6d>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m\u001b[0m\n\u001b[0;32m      1\u001b[0m \u001b[1;32mfrom\u001b[0m \u001b[0mbasic_functions\u001b[0m \u001b[1;32mimport\u001b[0m \u001b[1;33m*\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      2\u001b[0m \u001b[1;32mimport\u001b[0m \u001b[0mtime\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m----> 3\u001b[1;33m \u001b[0mcprint\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m'hw'\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[1;32mD:\\repos\\VOID\\wind\\basic_functions.py\u001b[0m in \u001b[0;36mcprint\u001b[1;34m(content, module, *args)\u001b[0m\n\u001b[0;32m      3\u001b[0m     \u001b[1;32mglobal\u001b[0m \u001b[0mtime\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      4\u001b[0m     \u001b[1;32mif\u001b[0m \u001b[0margs\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m----> 5\u001b[1;33m         \u001b[0mprint\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m'\\033[1;32;43m ['\u001b[0m\u001b[1;33m+\u001b[0m\u001b[0mmodule\u001b[0m\u001b[1;33m+\u001b[0m\u001b[1;34m'] \\033[0m '\u001b[0m\u001b[1;33m+\u001b[0m \u001b[0mcontent\u001b[0m \u001b[1;33m+\u001b[0m \u001b[1;34m'\\033[1;35m'\u001b[0m \u001b[1;33m+\u001b[0m\u001b[0mstr\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0margs\u001b[0m\u001b[1;33m)\u001b[0m \u001b[1;33m+\u001b[0m\u001b[1;34m' \\033[0m'\u001b[0m \u001b[1;33m+\u001b[0m \u001b[0mtime\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mstrftime\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\" |%Y-%m-%d %H:%M:%S|\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mtime\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mlocaltime\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m)\u001b[0m \u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m      6\u001b[0m     \u001b[1;32melse\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      7\u001b[0m         \u001b[0mprint\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m'\\033[1;32;43m ['\u001b[0m\u001b[1;33m+\u001b[0m\u001b[0mmodule\u001b[0m\u001b[1;33m+\u001b[0m\u001b[1;34m'] \\033[0m '\u001b[0m\u001b[1;33m+\u001b[0m \u001b[0mcontent\u001b[0m \u001b[1;33m+\u001b[0m \u001b[0mtime\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mstrftime\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\" |%Y-%m-%d %H:%M:%S|\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mtime\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mlocaltime\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mNameError\u001b[0m: name 'time' is not defined"
     ]
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
